const telegramConstant = {
    sendMessage: "/sendMessage",

    welcomeMsg: "به کوین‌جت خوش آمدید!\n" +
        "دیگر لازم نیست نگران از دست دادن سیگنال‌های خوب باشید و وقت زیادی صرف بررسی قیمت و ثبت سفارش کنید.\n" +
        "با استفاده از بات کوین‌جت می‌توانید حساب صرافی‌تان را به کانال سیگنال‌دهی محبوب خود متصل کنید تا کوین‌جت برای شما به صورت خودکار معامله کند.\n" +
        "کوین‌جت به هیچ وجه امکان برداشت از حساب شما را ندارد و اطلاعات دارایی‌های شما را نیز تنها به خودتان نمایش می‌دهد.",
    chooseExchanges: "در ادامه می‌توانید حساب صرافی‌های خود را به حساب کوین‌جت متصل کنید.\n" +
        "از میان صرافی‌های زیر که ما آن‌ها را پشتیبانی می‌کنیم یکی را انتخاب کنید:",
    sendYourCredentialsAndName: "برای اینکه بتوانید حساب‌های صرافی خود را از هم تفکیک کنید باید برای حساب خود نامی انتخاب کنید\n" +
        "همچنین لازم است به بخش اتصال API در حساب صرافی خود بروید و یک API جدید بسازید. اطلاعات API ساخته شده را به شکل زیر در اینجا وارد کنید:\n" +
        "Name, API Key, API Secret, API Passphrase\n" +
        "مثال:\n" +
        "MyKuCoin, 92640192872398752395, 9w8fysdfoghdf, cocococo",
    alreadySettingExchange: "شما هم اکنون یک حساب صرافی ناقص دارید! می‌توانید حساب خود را کامل کنید\n",
    exchangeCompleted: "اطلاعات شما با موفقیت ثبت شد.",
    noUnCompletedExchange: "اطلاعات حساب صرافی‌های شما از قبل کامل است.",
}

export default telegramConstant