const telegramConstant = {
    sendMessage: "/sendMessage",

    welcomeMsg: "به کوین‌جت خوش آمدید!\n" +
        "دیگر لازم نیست نگران از دست دادن سیگنال‌های خوب باشید و وقت زیادی صرف بررسی قیمت و ثبت سفارش کنید.\n" +
        "با استفاده از بات کوین‌جت می‌توانید حساب صرافی‌تان را به کانال سیگنال‌دهی محبوب خود متصل کنید تا کوین‌جت برای شما به صورت خودکار معامله کند.\n" +
        "کوین‌جت به هیچ وجه امکان برداشت از حساب شما را ندارد و اطلاعات دارایی‌های شما را نیز تنها به خودتان نمایش می‌دهد.\n\n" +
        "در ادامه می‌توانید حساب صرافی‌های خود را به حساب کوین‌جت متصل کنید.\n" +
        "از میان صرافی‌های زیر که ما آن‌ها را پشتیبانی می‌کنیم یکی را انتخاب کنید:",
}

export default telegramConstant